In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [
    [1.4,np.nan],
    [7.1,-4.5],
    [np.nan,np.nan],
    [0.75,-1.3]
]

In [50]:
df = pd.DataFrame(data,columns=['one','two'],index=['a','b','c','d'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
# 행방향 혹은 열방향의 합계구하기 - nan데이터가 있어도 계산을 해준다.!!!
df.sum(axis = 0)

one    9.25
two   -5.80
dtype: float64

In [5]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [51]:
# 행방향 혹은 열방향의 평균구하기  - nan값을 빼고 계산해준다.!
df.mean(axis = 0)

one    3.083333
two   -2.900000
dtype: float64

In [52]:
df.mean(axis = 1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [8]:
# 특정 행와 열 합구하기
df['one'].sum()

9.25

In [9]:
df['one'].mean()

3.0833333333333335

In [10]:
# 행의 합계는 loc를 써야한다.!!
df.loc['b',:].sum()

2.5999999999999996

In [11]:
# 분산구하기
df.var(axis = 0)

one    12.205833
two     5.120000
dtype: float64

In [12]:
df.var(axis = 1)

a         NaN
b    67.28000
c         NaN
d     2.10125
dtype: float64

In [55]:
# nan이 있는 곳을 계산하지 않는다.
df.mean(axis = 1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [14]:
# one의 nan은 one의 평균값으로 대체한다.?
onenan = df['one'].isnull()
df[onenan] = df.loc[:,'one'].mean()
# two의 nan은 가장 작은 값으로 대체한다.
twonan = df['two'].isnull()
df[twonan] = df.loc[:,'two'].min()

In [15]:
df

        one       two
a -4.500000 -4.500000
b  7.100000 -4.500000
c  3.083333  3.083333
d  0.750000 -1.300000

In [16]:
one_mean = df.mean(axis=0)['one']
df['one'] = df['one'].fillna(value=one_mean)
two_min = df.min(axis=0)['two']
df['two'] = df['two'].fillna(value=two_min)

In [17]:
df

        one       two
a -4.500000 -4.500000
b  7.100000 -4.500000
c  3.083333  3.083333
d  0.750000 -1.300000

# 상관계수와 분산

In [18]:
df = pd.DataFrame(np.random.rand(6,4))
df.columns = ['A','B','C','D']
df.index =  pd.date_range('20181116',periods=6) 
df

                   A         B         C         D
2018-11-16  0.522278  0.604093  0.002567  0.064019
2018-11-17  0.296899  0.574082  0.493413  0.241139
2018-11-18  0.051639  0.062791  0.368022  0.193943
2018-11-19  0.952800  0.989779  0.542706  0.919671
2018-11-20  0.135527  0.107150  0.162774  0.808473
2018-11-21  0.455956  0.967257  0.171184  0.584252

In [19]:
# A열과 B열의 상관계수(피어슨 상관계수) 60-80상관깊음  - 두 변수간의 연관성을 보여주는 값!
df['A'].corr(df['D'])

0.4116573234558536

In [20]:
# 분산 - 데이터 2개에 대한 차이는 교집합 C에 대한 A의 분산정도 - 교집합??의 정도?
df['A'].cov(df['C'])

0.01667899054646965

In [21]:
df.corr()

          A         B         C         D
A  1.000000  0.857253  0.242921  0.411657
B  0.857253  1.000000  0.163009  0.286081
C  0.242921  0.163009  1.000000  0.282473
D  0.411657  0.286081  0.282473  1.000000

In [22]:
df.corr().min()

A    0.242921
B    0.163009
C    0.163009
D    0.282473
dtype: float64

In [23]:
df.cov()

          A         B         C         D
A  0.105113  0.111485  0.016679  0.047119
B  0.111485  0.160900  0.013847  0.040514
C  0.016679  0.013847  0.044849  0.021120
D  0.047119  0.040514  0.021120  0.124643

In [24]:
dates = df.index
random_dates = np.random.permutation(dates) # 있는데이터를 섞어준다.
df2 = df.reindex(index = random_dates, columns=['D','B','C','A'])
df2

                   D         B         C         A
2018-11-17  0.241139  0.574082  0.493413  0.296899
2018-11-18  0.193943  0.062791  0.368022  0.051639
2018-11-21  0.584252  0.967257  0.171184  0.455956
2018-11-20  0.808473  0.107150  0.162774  0.135527
2018-11-16  0.064019  0.604093  0.002567  0.522278
2018-11-19  0.919671  0.989779  0.542706  0.952800

In [25]:
#  index를 오름차순으로 정리
df2.sort_index(axis = 0)

                   D         B         C         A
2018-11-16  0.064019  0.604093  0.002567  0.522278
2018-11-17  0.241139  0.574082  0.493413  0.296899
2018-11-18  0.193943  0.062791  0.368022  0.051639
2018-11-19  0.919671  0.989779  0.542706  0.952800
2018-11-20  0.808473  0.107150  0.162774  0.135527
2018-11-21  0.584252  0.967257  0.171184  0.455956

In [26]:
df2.sort_index(axis = 1)

                   A         B         C         D
2018-11-17  0.296899  0.574082  0.493413  0.241139
2018-11-18  0.051639  0.062791  0.368022  0.193943
2018-11-21  0.455956  0.967257  0.171184  0.584252
2018-11-20  0.135527  0.107150  0.162774  0.808473
2018-11-16  0.522278  0.604093  0.002567  0.064019
2018-11-19  0.952800  0.989779  0.542706  0.919671

In [27]:
# 내림차순으로 index 정리
df2.sort_index(axis = 0,ascending=False)

                   D         B         C         A
2018-11-21  0.584252  0.967257  0.171184  0.455956
2018-11-20  0.808473  0.107150  0.162774  0.135527
2018-11-19  0.919671  0.989779  0.542706  0.952800
2018-11-18  0.193943  0.062791  0.368022  0.051639
2018-11-17  0.241139  0.574082  0.493413  0.296899
2018-11-16  0.064019  0.604093  0.002567  0.522278

In [28]:
# D열의 값을 기준으로 오름차순  - by D열기준으로!
df2.sort_values(by='D')

                   D         B         C         A
2018-11-16  0.064019  0.604093  0.002567  0.522278
2018-11-18  0.193943  0.062791  0.368022  0.051639
2018-11-17  0.241139  0.574082  0.493413  0.296899
2018-11-21  0.584252  0.967257  0.171184  0.455956
2018-11-20  0.808473  0.107150  0.162774  0.135527
2018-11-19  0.919671  0.989779  0.542706  0.952800

In [29]:
# df2에 열추가하기
df2['E'] = np.random.randint(0,6,size=6)
df2['F'] = ['alpha','beta','gamma','gamma','alpha','gamma']
df2

                   D         B         C         A  E      F
2018-11-17  0.241139  0.574082  0.493413  0.296899  1  alpha
2018-11-18  0.193943  0.062791  0.368022  0.051639  5   beta
2018-11-21  0.584252  0.967257  0.171184  0.455956  4  gamma
2018-11-20  0.808473  0.107150  0.162774  0.135527  4  gamma
2018-11-16  0.064019  0.604093  0.002567  0.522278  5  alpha
2018-11-19  0.919671  0.989779  0.542706  0.952800  3  gamma

In [30]:
# 2개의 열들의 값으로 정렬 !!!!!!!!!!!!! 많이 쓴다.
df2.sort_values(by = ['E','F'])

                   D         B         C         A  E      F
2018-11-17  0.241139  0.574082  0.493413  0.296899  1  alpha
2018-11-19  0.919671  0.989779  0.542706  0.952800  3  gamma
2018-11-21  0.584252  0.967257  0.171184  0.455956  4  gamma
2018-11-20  0.808473  0.107150  0.162774  0.135527  4  gamma
2018-11-16  0.064019  0.604093  0.002567  0.522278  5  alpha
2018-11-18  0.193943  0.062791  0.368022  0.051639  5   beta

In [31]:
#Unique한 값
df2['F'].unique()

array(['alpha', 'beta', 'gamma'], dtype=object)

In [32]:
# 값에 따른 갯수 출력
df2['F'].value_counts()

gamma    3
alpha    2
beta     1
Name: F, dtype: int64

In [33]:
# 해당값이 포함되어 있는지 확인
df2['F'].isin(['alpah','beta'])

2018-11-17    False
2018-11-18     True
2018-11-21    False
2018-11-20    False
2018-11-16    False
2018-11-19    False
Name: F, dtype: bool

In [34]:
df2.loc[df2['F'].isin(['alpha','beta'])]

                   D         B         C         A  E      F
2018-11-17  0.241139  0.574082  0.493413  0.296899  1  alpha
2018-11-18  0.193943  0.062791  0.368022  0.051639  5   beta
2018-11-16  0.064019  0.604093  0.002567  0.522278  5  alpha

In [35]:
del df2['F']
df2

                   D         B         C         A  E
2018-11-17  0.241139  0.574082  0.493413  0.296899  1
2018-11-18  0.193943  0.062791  0.368022  0.051639  5
2018-11-21  0.584252  0.967257  0.171184  0.455956  4
2018-11-20  0.808473  0.107150  0.162774  0.135527  4
2018-11-16  0.064019  0.604093  0.002567  0.522278  5
2018-11-19  0.919671  0.989779  0.542706  0.952800  3

In [36]:
# 사용자 함수
func = lambda x : x.max() - x.min()

In [37]:
# 만들어 쓸 수 있는 함수 쓰기 - apply 는 함수를 쓰게 해주는 함수 - 본인이 만들어준 함수와 일반함수도 사용가능!
df2.apply(func, axis=0)

D    0.855651
B    0.926988
C    0.540139
A    0.901161
E    4.000000
dtype: float64

In [38]:
def maxmin(x):
    return x.max() - x.min()

In [39]:
df2.apply(maxmin, axis=0)

D    0.855651
B    0.926988
C    0.540139
A    0.901161
E    4.000000
dtype: float64

In [40]:
# 사용자 함수에 의한 정렬 - 프레임에 제일 먼저 오는것은 data - 인덱스는 잘 만들어서 쓰는게 좋다.
df3 = pd.DataFrame(
    np.random.rand(4,3),
    columns = ['b','d','e'],
    index = ['Seoul','Incheon','Busan','Daegu']
)
df3

                b         d         e
Seoul    0.789678  0.731580  0.412695
Incheon  0.595065  0.731356  0.229057
Busan    0.044623  0.146473  0.898836
Daegu    0.309801  0.871092  0.095147

In [41]:
# 사용자 함수 - 람다는 함수명이 앞에 쓰인다. func
func = lambda x: x.max() - x.min()

In [42]:
# df3에 실행한다. axis 0은 행? 1은 열?
df3.apply(func, axis = 0)

b    0.745055
d    0.724618
e    0.803689
dtype: float64

In [43]:
df3.apply(func, axis = 1)

Seoul      0.376983
Incheon    0.502299
Busan      0.854213
Daegu      0.775945
dtype: float64

In [44]:
# 간단한 것은 람다함수 - 리턴값을한줄 복잡해지면 일반함수 사용하는게 편하다.?
def func1(x):
    return x.max() - x.min()

In [45]:
df3.apply(func1, axis = 0)

b    0.745055
d    0.724618
e    0.803689
dtype: float64

In [46]:
df3.apply(func1, axis = 1)

Seoul      0.376983
Incheon    0.502299
Busan      0.854213
Daegu      0.775945
dtype: float64